#include  <stdio.h>
int main() {
    //利用二维数组实现图形化
    int a[8][8] = {
     0,0,0,0,0,0,0,0,
     0,1,1,0,0,1,1,0,
     1,0,0,1,1,0,0,1,
     1,0,0,0,0,0,0,1,
     0,1,1,0,0,1,1,0,
     0,0,0,1,1,0,0,0,
     0,0,0,0,0,0,0,0,
     0,0,0,0,0,0,0,0,
    };
    for (int i = 0; i < 8; i++)
    {
        for (int j = 0; j < 8; j++)
        {
            switch (a[i][j])
            {
            case 0:
                printf("   ");
                break;
            case 1:
                printf("■");//可以去找一些汉字图案
                break;
            }
        }
        printf("\n");
    } 
   return 0;
}
